<?php

return array(
    'methods' => array(
        'loadFromFile' => 'Загрузить из файла',
        'loadFromBitmap' => 'Загрузить из битовой карты',
        'loadFromUrl' => 'Загрузить по URL адресу',
        'saveToFile' => 'Сохранить в файл',

        'picture' => array(
            'loadFromStr' => 'Загрузить из строки',
            'assign' => 'Присвоить',
            'clear' => 'Очистить',
            'isEmpty' => 'Присвоена ли',
            'copyToClipboard' => 'Копировать в буфер обмена',
            'pasteFromClipboard' => 'Вставить из буфера обмена',
            'getBitmap' => 'Получить битовую карту'
        ),

        'setDate' => 'Установить дату в качестве текста',
        'setTime' => 'Установить время в качестве текста',
        'setFocus' => 'Сфокусироваться',
        'show' => 'Показать',
        'hide' => 'Скрыть',
        'toBack' => 'Установить на задний план',
        'toFront' => 'Установить на передний план',
        'invalidate' => 'Запросить перерисовку',
        'repaint' => 'Перерисовать немедленно',
        'perform' => 'Отправить сообщение',
        'create' => 'Создать объект',
        'free' => 'Освободить (из памяти) объект',
        'safeFree' => 'Безопасно освободить (из памяти) объект',
        'undo' => 'Вернуть старый текст',
        'clearSelected' => 'Очистить выделенный текст',
    )
);